## Introduction to Pandas ##

With Numpy, it may sometimes still be a pain to manipulate data. For example, matrices in Numpy can't be labelled. The library Pandas has many goodies, but one of the most important is that it allows us to represent data in a table format (not unlike how we could imagine seeing them in Excel). This makes everything a lot more intuitive.

We first import the libraries. Numpy is also imported as we will usually use Numpy functions alongside Pandas

In [2]:
import numpy as np
import pandas as pd

#### Series ####

We first start with series before we go to dataframes. A dataframe is basically akin to a table, and a series akin to a column in the table.

Series will be used a lot when we do time series analysis

In [3]:
s1 = pd.Series(np.random.rand(4), index=['a', 'b', 'c', 'd'])
s1

a    0.041447
b    0.275973
c    0.469297
d    0.897424
dtype: float64

In [4]:
s1['c']

0.46929705786676734

We can also create a Series from a dict.

In [6]:
s2 = pd.Series({'a':1, 'b':'2', 'c':3})
s2

a    1
b    2
c    3
dtype: object

To check if there are any entries that are null

In [5]:
pd.isnull(s2)

a    False
b    False
c    False
dtype: bool

In [6]:
s3 = pd.Series(100, index=['x', 'y', 'z'])
s3

x    100
y    100
z    100
dtype: int64

In [7]:
a = np.array([2,3,4])
p = pd.Series(a, index=['a', 'b', 'c'])
p

a    2
b    3
c    4
dtype: int64

Extending what we do for series to a dataframe is easy.

In [7]:
data = {'Age':[1,2,3,4,5], 
        'Income':['H', 'M', 'L', 'M', 'L'], 
        'Gender': ['M', 'F', 'M', 'F', 'M']}
profile = pd.DataFrame(data)
profile

   Age Gender Income
0    1      M      H
1    2      F      M
2    3      M      L
3    4      F      M
4    5      M      L

In [8]:
# Setting columns and indices
profile_2 = pd.DataFrame(data, columns=['Income', 'Age', 'Gender'], index=['A','B','C','D','E'])
profile_2

  Income  Age Gender
A      H    1      M
B      M    2      F
C      L    3      M
D      M    4      F
E      L    5      M

In [9]:
cohort = pd.DataFrame([['John', 20, 'Dentist'], 
                      ['Peter', 30, 'Doctor'],
                      ['Dirk', 40, 'Teacher']], 
                     columns=['Name', 'Age', 'Job'])
cohort

    Name  Age      Job
0   John   20  Dentist
1  Peter   30   Doctor
2   Dirk   40  Teacher

In [10]:
cohort['Name']

0     John
1    Peter
2     Dirk
Name: Name, dtype: object

Elements can be accessed by - <br>
* loc works on labels in the index.
* iloc works on the positions in the index (so it only takes integers).
* ix usually tries to behave like loc but falls back to behaving like iloc if the label is not in the index.

In [11]:
#iloc, ix, loc
cohort.ix[1]

Name     Peter
Age         30
Job     Doctor
Name: 1, dtype: object

In [12]:
cohort.iloc[2,1]

40

In [13]:
cohort.to_csv('cohort.csv')

In [14]:
cohort2 = pd.read_csv('cohort.csv')

In [15]:
cohort2

   Unnamed: 0   Name  Age      Job
0           0   John   20  Dentist
1           1  Peter   30   Doctor
2           2   Dirk   40  Teacher

In [16]:
s2

a    1
b    2
c    3
dtype: object

In [17]:
s2.reindex(['a', 'e', 'b'], fill_value='MISSING')

a          1
e    MISSING
b          2
dtype: object

In [18]:
cohort.tail(2)

    Name  Age      Job
1  Peter   30   Doctor
2   Dirk   40  Teacher

In [19]:
cohort.head(2)

    Name  Age      Job
0   John   20  Dentist
1  Peter   30   Doctor

In [20]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4))
df2 = pd.DataFrame(np.arange(20).reshape(4,5))

In [21]:
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [22]:
df2

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [23]:
# Broadcast when they are not the same size
df1 + df2

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [24]:
df3 =df1.add(df2, fill_value=0)

In [25]:
df3

      0     1     2     3     4
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [26]:
df3.eq(df2)

       0      1      2      3     4
0   True  False  False  False  True
1  False  False  False  False  True
2  False  False  False  False  True
3   True   True   True   True  True

In [27]:
cohort

    Name  Age      Job
0   John   20  Dentist
1  Peter   30   Doctor
2   Dirk   40  Teacher

In [28]:
# Python 2 only
# cohort.irow(1)

In [29]:
# Python 2 only
# cohort.icol(1)

Something like **covariance** is trivial in Pandas

In [30]:
s_one = pd.Series(np.random.rand(3))

In [31]:
s_two = pd.Series(np.random.rand(3))

In [32]:
s_one.cov(s_two)

0.03388788576785875

In [33]:
df_three = pd.DataFrame(np.random.rand(12).reshape(4,3),  
                       columns=['a','b','c'])

In [34]:
df_three

          a         b         c
0  0.040781  0.136619  0.454001
1  0.983112  0.032677  0.705141
2  0.672182  0.706941  0.348606
3  0.716236  0.885049  0.043661

In [35]:
df_three.cov()

          a         b         c
a  0.159395  0.028200  0.013909
b  0.028200  0.175759 -0.104322
c  0.013909 -0.104322  0.075019

In [36]:
df_three.corr(method='spearman') # pearson, kendall, spearman

     a    b    c
a  1.0 -0.2  0.2
b -0.2  1.0 -1.0
c  0.2 -1.0  1.0

In [37]:
# Correlation between Series with the same label in different Series
df_four = pd.DataFrame(np.arange(8).reshape(4,2), 
                       columns=['a', 'b'])

In [38]:
df_five=df_four.corrwith(df_three)

In [39]:
df_five

a    0.554705
b    0.899046
c         NaN
dtype: float64

In [40]:
df_five.isnull()

a    False
b    False
c     True
dtype: bool

In [41]:
df_five.notnull()

a     True
b     True
c    False
dtype: bool

In [42]:
df_five.dropna()

a    0.554705
b    0.899046
dtype: float64

In [43]:
df_five.fillna(-1)

a    0.554705
b    0.899046
c   -1.000000
dtype: float64